fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// Проверка договора
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидДоговора, ВКМ_ДатаНачала, ВКМ_ДатаОкончания, ВКМ_СуммаАбонентскойПлаты, ВКМ_СтимостьЧаса");
	
	// Проверка на вид договора
	Если Не ДанныеДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		
		Сообщение = "Для данного вида обслуживания должен быть выбран договор абонентского обслуживания";
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	// Проверка документа на то, что дата проведения работ должна находится в периоде действия договора
	Если НачалоДня(ДанныеДоговора.ВКМ_ДатаНачала) > НачалоДня(ДатаПроведенияРабот) 
			Или НачалоДня(ДанныеДоговора.ВКМ_ДатаОкончания) < НачалоДня(ДатаПроведенияРабот) Тогда
		
		Сообщение = "Дата проведения работ должна находится в периоде действия договора";
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	Движение.КоличествоЧасов = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");;
	Движение.СуммаКОплате = Движение.КоличествоЧасов * ДанныеДоговора.ВКМ_СтимостьЧаса;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ПроцентОтРабот = Неопределено Тогда
			
			Сообщение = "Не заполнены данные регистра ""Условия оплаты сотрудников"" на дату проведения документа.";
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");;
		Движение.СуммаКОплате = Движение.ЧасовКОплате * ДанныеДоговора.ВКМ_СтимостьЧаса * Выборка.ПроцентОтРабот / 100;
		
	КонецЕсли;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Текст = СтрШаблон("Содана новая заявка № %1: Специалист %2, Дата проведения работ %3, Время начала %4, Время окнчания %5",
							Номер, Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот);
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.Текст = Текст;
		НовыйЭлемент.Записать();
		
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		
		СписокИзменений = Новый Массив;
		
		ПроверитьИзменениеДокумента(Ссылка, СписокИзменений);
		
		Если СписокИзменений.Количество() = 0 Тогда
			Возврат;
		Иначе
			Текст = СтрШаблон("Заявка № %1. Изменено: %2.", Номер, СтрСоединить(СписокИзменений, ", "));
			НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			НовыйЭлемент.Текст = Текст;
			НовыйЭлемент.Записать();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьИзменениеДокумента(Документ, МассивИзменений)
	
	Выборка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот");    
	
	Если Не Выборка.Специалист = Специалист Тогда
		МассивИзменений.Добавить(СтрШаблон("Специалист с %1 на %2", Выборка.Специалист, Специалист));
	КонецЕсли;
	
	Если Не Выборка.ДатаПроведенияРабот = ДатаПроведенияРабот Тогда
		МассивИзменений.Добавить(СтрШаблон("Дата проведения работ с %1 на %2", Выборка.ДатаПроведенияРабот, ДатаПроведенияРабот));
	КонецЕсли;
	
	Если Не Выборка.ВремяНачалаРабот = ВремяНачалаРабот Тогда
		МассивИзменений.Добавить(СтрШаблон("Время начала работ с %1 на %2", Формат(Выборка.ВремяНачалаРабот, "ДЛФ=T;"), Формат(ВремяНачалаРабот, "ДЛФ=T;")));
	КонецЕсли;
	
	Если Не Выборка.ВремяОкончанияРабот = ВремяОкончанияРабот Тогда
		МассивИзменений.Добавить(СтрШаблон("Время окончания работ с %1 на %2", Формат(Выборка.ВремяОкончанияРабот, "ДЛФ=T;"), Формат(ВремяОкончанияРабот, "ДЛФ=T;")));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
